docs/mathematics/single_variable_calculus/KBe21math401ret15_1TaylorSeriesPolynomial.tex
% Created 2021-09-11 Sat 16:43
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}


\section{find taylor series}
\label{sec:org254cffc}

\subsection{\(y = \cos(x)\)}
\label{sec:orgdc1145b}
$\backslash$[
\begin{aligned}
     P_n(x) &= f(0) &+& \frac{d}{dx}f(0)x &+& \frac{\frac{d^2}{d^2x}f(0)}{2!}x^2 &+& \frac{\frac{d^3}{d^3x}f(0)}{3!}x^3 &+& \cdots\\
	     &= \cos(0) &-&\sin(0)x &+& \frac{-\cos(0)}{2!}x^2 &+& \frac{\sin(0)}{3!}x^3 &+& \cdots\\
	     &= 1 &-& 0 x &-& \frac{1}{2!}x^2 &+& \frac{0}{3!}x^3 &+& \cdots\\
	     &= 1 && &-& \frac{1}{2!}x^2 && &+& \frac{1}{4!} x^4 + \cdots\\
     &= \sum_{k=0} \frac{(-1)^k}{(2k)!}x^{2k}
\end{aligned}
$\backslash$]
\subsection{\(y = e^x\)}
\label{sec:org4ca62d0}

\[\begin{aligned}
   P_n(x) &= f(0) &+& \frac{d}{dx}f(0)x &+& \frac{\frac{d^2}{d^2x}f(0)}{2!}x^2 &+& \frac{\frac{d^3}{d^3x}f(0)}{3!}x^3 &+& \cdots\\
          &= e^0 &+& e^0x &+& \frac{e^0}{2!}x^2 &+& \frac{e^0}{3!}x^3 &+& \cdots\\
          &= 1 &+& x &+& \frac{1}{2!}x^2 &+& \frac{1}{3!}x^3 &+& \cdots\\
          &= \sum_{k=0} \frac{x^k}{k!}
   \end{aligned}\]

\subsection{\(y = \sqrt x\) centered at \(x=1\)}
\label{sec:org0c3b7c4}
\[\begin{aligned}
   P_n(x) &= f(1) &+& \frac{d}{dx}f(1)(x-1) &+& \frac{\frac{d^2}{d^2x}f(1)}{2!}(x-1)^2 &+& \frac{\frac{d^3}{d^3x}f(1)}{3!}(x-1)^3 &+& \cdots\\
          &= 1 &+& \frac{1}{2}(x-1) &+& \frac{\frac{1}{2}\frac{-1}{2}}{2!}(x-1)^2 &+& \frac{\frac{1}{2}\frac{-1}{2}\frac{-3}{2}}{3!}(x-1)^3 &+& \cdots\\
   \end{aligned}\]
I don't know how to write it using summation notation though..

\section{prove approximations}
\label{sec:org03e1b7a}
\subsection{\(\frac{1}{1-x} = 1 + x + x^2 + x^3 + \cdots\)}
\label{sec:orgb9b38f4}
Proof by geometric series
\subsection{\(\frac{1}{1+x} = 1 - x + x^2 - x^3 + \cdots\)}
\label{sec:orgba049e6}
Plug \(-x\) for \(x\) in the previous equation.
\subsection{\(\frac{1}{1+x^2} = 1 - x^2 + x^4 - x^6 + \cdots\)}
\label{sec:org4fe0542}
Plug \(x^2\) for \(x\) in the previous equation.
\section{more finding of polynomial}
\label{sec:org2fec17f}
\subsection{{\bfseries\sffamily TODO} \$ y = \(\ln\)(1+x)\$}
\label{sec:orgc15b46a}
\subsection{{\bfseries\sffamily TODO} \(y = \tan^- x\)}
\label{sec:orgfc60741}
\subsection{\(y = (1+x)^k\)}
\label{sec:org0316c1e}
\[\begin{aligned}
   P_n(x) &= f(0) &+& \frac{d}{dx}f(0)x &+& \frac{\frac{d^2}{d^2x}f(0)}{2!}x^2 &+& \frac{\frac{d^3}{d^3x}f(0)}{3!}x^3 &+& \cdots\\
          &= 1 + k(1)^k &+& k(k-1)(1)^{k-1}x &+& \frac{k(k-1)(k-2)(1)^{k-2}}{2!}x^2 &+& \frac{k(k-1)(k-2)(k-3)(1)^{k-3}}{3!}x^3 &+& \cdots\\
          &= 1 + k &+& k(k-1)x &+& \frac{k(k-1)(k-2)}{2!}x^2 &+& \frac{k(k-1)(k-2)(k-3)}{3!}x^3 &+& \cdots\\
          &= 1 + k &+& \frac{k!}{(k-1)!}x &+& \frac{\frac{k!}{(k-2)!}}{2!}x^2 &+& \frac{\frac{k!}{(k-3)!}}{3!}x^3 &+& \cdots\\
          &= 1 + k &+& \frac{k!x}{(k-1)!} &+& \frac{k!}{(k-2)!2!}x^2 &+& \frac{k!}{(k-3)!3!}x^3 &+& \cdots\\
		  &= {k \choose 0} + {k \choose 1}x &+& {k \choose 2}x^2 &+& {k \choose 3}x^3 &+& \cdots\\
		  &= \sum_{i=0} {k \choose i} x^i
	\end{aligned}\]
\section{find sum of series by recognizing Taylor Series approximations of some functions}
\label{sec:org15fb828}
\subsection{\(3 + \frac{9}{2!} + \frac{27}{3!} + \frac{81}{4!} + \cdots\)}
\label{sec:org0c174d7}
\[\begin{aligned}
   3 &+& \frac{9}{2!} &+& \frac{27}{3!} &+& \frac{81}{4!} = e^3 - 1
   \end{aligned}\]

\subsection{\(1-\ln 2 + \frac{\ln ^2 2}{2!} + \frac{\ln ^3 2}{3!} + \cdots\)}
\label{sec:org4002263}
\[\begin{aligned}
   1-\ln 2 + \frac{\ln ^2 2}{2!} + \frac{\ln ^3 2}{3!} + \cdots = e^{-\ln 2} = \frac{1}{2}
	\end{aligned}\]


\subsection{\(\sum_{k=0}^\infty \frac{(-1)^k \pi^{2k+1}}{4^{2k+1}(2k+1)!}\)}
\label{sec:orgf941086}
\[\begin{aligned}
\sum_{k=0}^\infty \frac{(-1)^k \pi^{2k+1}}{4^{2k+1}(2k+1)!} =
\sum_{k=0}^\infty \frac{(-1)^k \left(\frac{\pi}{4}^{2k+1}\right)}{(2k+1)!} =
\sin \frac{\pi}{4} = \frac{\sqrt 2}{2}
\end{aligned}\]

\section{evaluate limits using taylor series approx}
\label{sec:org1ae38ca}

\subsection{\(\lim\limits_{x\to 0} \frac{\sin x - x + \frac{1}{6} x^3}{x^5}\)}
\label{sec:orgc0963d6}
\[\begin{aligned}
	\lim\limits_{x\to 0} \frac{\sin x - x + \frac{1}{6} x^3}{x^5}\\
	=& \lim\limits_{x\to 0} \frac{\cancel x-\frac{x^3}{6}+\frac{x^5}{5!} + \cdots \cancel{- x} + \frac{x^3}{6}}{x^5}\\
	=& \lim\limits_{x\to 0} \frac{\cancel{-\frac{x^3}{6}+}\frac{x^5}{5!} + \cdots \cancel{+ \frac{x^3}{6}}}{x^5}\\
	=& \lim\limits_{x\to 0} \frac{\frac{\cancel{x^5}}{5!} + \cdots}{x^5}\\
	=& \lim\limits_{x\to 0} \frac{1}{5!} + \frac{x^7}{x^5 7!} + \frac{x^9}{x^5 9!} \cdots\\
	=& \frac{1}{5!}
   \end{aligned}\]

\subsection{{\bfseries\sffamily TODO} \(\lim\limits_{x\to 0}\frac{x-\tan^- x}{x^3}\)}
\label{sec:org025a506}

\section{find taylor series approximations}
\label{sec:orgb9024e7}

\subsection{\(y = e^x + e^{-x}\)}
\label{sec:orgaeb622b}
\[\begin{aligned}
   e^x + e^{-x}\\
   =& 1 + x + \frac{x^2}{2!} \frac{x^3}{3!} + \cdots + 1 - x + \frac{x^2}{2!} - \frac{x^3}{3!}\\
   =& 1 + 1 + x - x + \frac{x^2}{2!} + \frac{x^2}{2!} + \frac{x^3}{3!} - \frac{x^3}{3^1} + \cdots\\
   =& 2\left(1 + \frac{x^2}{2!} + \frac{x^4}{4!} + \cdots \right)\\
   =& 2\sum_{k=0}\frac{x^{2k}}{(2k)!}
   \end{aligned}\]

\subsection{\(y = \sin (\pi x)\)}
\label{sec:org820abec}

$\backslash$[\begin{aligned}
\(\sin\) (\(\pi\) x) = \(\sum\)\textsubscript{k=0} \frac\{(-1)\textsuperscript{k} (\(\pi\) x)\textsuperscript{2k+1}\}\{(2k+1)!\}

   \end{aligned}
$\backslash$]
   (just plug it in)

\subsection{{\bfseries\sffamily TODO} \(y = \sin^2 x\)}
\label{sec:orgf705180}
\end{document}
